Revit 2027 API
AnalysisDisplayStyle.SetColoredSurfaceSettings Method
 Set colored surface settings object for the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetColoredSurfaceSettings(
	AnalysisDisplayColoredSurfaceSettings coloredSurfaceSettings
)
Public Sub SetColoredSurfaceSettings (
	coloredSurfaceSettings As AnalysisDisplayColoredSurfaceSettings
)
public:
void SetColoredSurfaceSettings(
	AnalysisDisplayColoredSurfaceSettings^ coloredSurfaceSettings
)
member SetColoredSurfaceSettings :
        coloredSurfaceSettings : AnalysisDisplayColoredSurfaceSettings -> unit
Parameters
coloredSurfaceSettings AnalysisDisplayColoredSurfaceSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  colored surface settings were not created with the object.
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace